# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

list_1 = [1, 3, 5, 2, 3, 4, 5, 6, 3, 4, 5, 9, 8, 7, 5, 11, 13, 11, 15]
b = set(list_1)
print(b)
print(len(b))
